[
  {
    "title": "Introduction to Yoga",
    "content": "Yoga is a mind and body practice with a 5,000-year history in ancient Indian philosophy. Various styles of yoga combine physical postures, breathing techniques, and meditation or relaxation. It is not just exercise but a way of living that aims towards 'a healthy mind in a healthy body'.",
    "source": "Yoga Basics - Article 1"
  },
  {
    "title": "Mountain Pose (Tadasana)",
    "content": "Tadasana or Mountain Pose is the foundation of all standing poses. It involves standing with feet together, grounding down through the four corners of the feet, engaging the thighs, and lengthening the spine. Benefits: Improves posture, strengthens thighs, knees, and ankles, and firms abdomen and buttocks. Contraindications: Headache, insomnia, low blood pressure.",
    "source": "Common Poses - Article 2"
  },
  {
    "title": "Downward Facing Dog (Adho Mukha Svanasana)",
    "content": "Downward Facing Dog is an inversion that stretches the shoulders, hamstrings, calves, arches, and hands. It strengthens the arms and legs. To perform: Start on hands and knees, lift knees away from floor, and push thighs back. Benefits: Calms the brain, energizes the body, relieves stiffness. Contraindications: Carpal tunnel syndrome, diarrhea, late-term pregnancy, high blood pressure.",
    "source": "Common Poses - Article 3"
  },
  {
    "title": "Warrior I (Virabhadrasana I)",
    "content": "Warrior I is a standing pose that stretches the chest and lungs, shoulders and neck, belly, and groins (psoas). It strengthens the shoulders and arms, and the muscles of the back. Benefits: Builds focus, power, and stability. Contraindications: High blood pressure, heart problems. Keep neck neutral if you have neck problems.",
    "source": "Common Poses - Article 4"
  },
  {
    "title": "Warrior II (Virabhadrasana II)",
    "content": "Warrior II increases stamina and strengthens the legs and ankles. It stretches the groins, chest, lungs, and shoulders. Benefits: Stimulates abdominal organs, relieves backaches. Contraindications: Diarrhea, high blood pressure. If you have neck problems, do not turn your head to look over the hand.",
    "source": "Common Poses - Article 5"
  },
  {
    "title": "Tree Pose (Vrksasana)",
    "content": "Tree Pose improves balance and stability in the legs. It strengthens the thighs, calves, ankles, and spine. It stretches the groins and inner thighs, chest and shoulders. Benefits: improves sense of balance, relieves sciatica. Contraindications: Headache, insomnia, low blood pressure. High blood pressure: Don't raise arms overhead.",
    "source": "Common Poses - Article 6"
  },
  {
    "title": "Triangle Pose (Trikonasana)",
    "content": "Triangle Pose stretches and strengthens the thighs, knees, and ankles. It stretches the hips, groins, hamstrings, and calves; shoulders, chest, and spine. Benefits: Stimulates abdominal organs, helps relieve stress, improves digestion. Contraindications: Diarrhea, headache, low blood pressure. Heart Condition: Practice against a wall.",
    "source": "Common Poses - Article 7"
  },
  {
    "title": "Child's Pose (Balasana)",
    "content": "Child's Pose is a resting pose that gently stretches the hips, thighs, and ankles. It calms the brain and helps relieve stress and fatigue. It can also relieve back and neck pain when done with head and torso supported. Contraindications: Diarrhea, pregnancy (widen knees), knee injury.",
    "source": "Restorative Poses - Article 8"
  },
  {
    "title": "Corpse Pose (Savasana)",
    "content": "Savasana is a pose of total relaxation. It calms the brain and helps relieve stress and mild depression. It relaxes the body, reduces headache, fatigue, and insomnia. It helps to lower blood pressure. Contraindications: Back injury (do with knees bent and feet on floor), pregnancy (raise head and chest on bolster).",
    "source": "Restorative Poses - Article 9"
  },
  {
    "title": "Cobra Pose (Bhujangasana)",
    "content": "Cobra Pose strengthens the spine, stretches chest and lungs, shoulders, and abdomen. It firms the buttocks and stimulates abdominal organs. Benefits: Helps relieve stress and fatigue, opens the heart and lungs. Contraindications: Back injury, carpal tunnel syndrome, headache, pregnancy.",
    "source": "Backbends - Article 10"
  },
  {
    "title": "Bridge Pose (Setu Bandha Sarvangasana)",
    "content": "Bridge Pose stretches the chest, neck, and spine. It calms the brain and helps alleviate stress and mild depression. It stimulates abdominal organs, lungs, and thyroid. Benefits: Rejuvenates tired legs, reduces anxiety. Contraindications: Neck injury. Avoid if you have a knee injury.",
    "source": "Backbends - Article 11"
  },
  {
    "title": "Seated Forward Bend (Paschimottanasana)",
    "content": "This pose calms the brain and helps relieve stress and mild depression. It stretches the spine, shoulders, and hamstrings. Benefits: Stimulates the liver, kidneys, ovaries, and uterus; improves digestion. Contraindications: Asthma, diarrhea, back injury (perform only under supervision).",
    "source": "Forward Bends - Article 12"
  },
  {
    "title": "Alternate Nostril Breathing (Nadi Shodhana)",
    "content": "Nadi Shodhana is a breathing technique that helps keep the mind calm, happy, and peaceful. It releases accumulated tension and fatigue. Benefits: Infuses the body with oxygen, clears and releases toxins, reduces stress and anxiety. Contraindications: None generally, but force should not be applied.",
    "source": "Pranayama - Article 13"
  },
  {
    "title": "Skull Shining Breath (Kapalabhati)",
    "content": "Kapalabhati is a warming pranayama. It consists of short, powerful exhales and passive inhales. Benefits: Cleanses lungs and respiratory system, improves digestion, tones abdominal muscles. Contraindications: Pregnancy, high blood pressure, heart disease, hernia, epilepsy, slip disc.",
    "source": "Pranayama - Article 14"
  },
  {
    "title": "Humming Bee Breath (Bhramari)",
    "content": "Bhramari is a calming breathing practice that soothes the nervous system. It helps to relieve tension, anger, and anxiety. It is effective in speeding up the healing of body tissues and may be performed after surgery. Benefits: Relieves cerebral tension, helps with insomnia. Contraindications: Chest infection.",
    "source": "Pranayama - Article 15"
  },
  {
    "title": "Yoga for Beginners Tips",
    "content": "1. Start slow and listen to your body. 2. Focus on your breath. 3. Don't compare yourself to others. 4. Wear comfortable clothing. 5. Stay hydrated. 6. Practice consistently, even if it's just for 10 minutes a day.",
    "source": "General Advice - Article 16"
  },
  {
    "title": "Yoga During Pregnancy (Prenatal Yoga)",
    "content": "Prenatal yoga can be a great way to prepare for childbirth. However, safety is paramount. Avoid deep twists, lying on your belly, and inversions. Focus on opening the hips and gentle stretching. Always consult your doctor before starting any exercise regimen during pregnancy.",
    "source": "Special Conditions - Article 17"
  },
  {
    "title": "Yoga for Back Pain",
    "content": "Gentle yoga can help relieve back pain. Poses like Cat-Cow, Child's Pose, and Sphinx Pose are beneficial. Avoid deep forward bends or backbends if you have acute pain. Strengthening the core is key to supporting the back.",
    "source": "Therapeutic Yoga - Article 18"
  },
  {
    "title": "Benefits of Meditation",
    "content": "Meditation helps reduce stress, anxiety, and pain. It improves focus, memory, and emotional regulation. Regular practice can lead to structural changes in the brain associated with learning and memory.",
    "source": "Meditation - Article 19"
  },
  {
    "title": "Contraindications for Inversions",
    "content": "Inversions like Headstand and Shoulderstand are not recommended for everyone. Contraindications include: High blood pressure, heart conditions, neck injuries, glaucoma, detached retina, and menstruation (depending on tradition). Beginners should practice near a wall or with a spotter.",
    "source": "Safety Guide - Article 20"
  },
  {
    "title": "Yoga for Stress Relief",
    "content": "Restorative yoga and Yin yoga are excellent for stress relief. Holding poses for longer periods helps release tension in the connective tissues. Recommended poses: Legs-Up-The-Wall, Reclined Bound Angle Pose.",
    "source": "Therapeutic Yoga - Article 21"
  }
]
